print("HELLO WORLD")
#функция print нужна для вывода данных в окно консоли

name = input("Скажи своё имя:")
#Переменная, которая хранит в себе строку
age = input("Введите свой возраст")
#Переменная, которая хранит в себе целочисленное число
water = 4,5
#Переменная, которая хранит в себе дробь
print(type(age), type(name))
print("Привет,",name,'тебе',age,'лет')
'''
Функция type - нужна для определения 
типа данных наших переменных
'''
print("я пью", water, ' литра воды')
#5*8/10
answer = int(input("сколько будет 5*8/10?"))
print("Правильный ответ: 4, ваш ответ:",answer)
#x2+3x+6=0
answer = int(input("найдите дискриминант: x2+3x+6=0"))
print("Правильный ответ: -15, ваш ответ:",answer)

#Задание 1
#Пользователь вводит с клавиатуры 3 числа. Необходимо найти сумму чисел,
#найти произведение чисел, найти разность чисел, найти деление чисел.
#Результат вычислений операций вывести на экран.

